# Date & Time Handling

Working with dates, times, and time series data using Pandas.

In [1]:
import pandas as pd
import numpy as np

df = pd.DataFrame({
    'date': ['2023-01-01', '2023-01-05', '2023-02-01', '2023-02-10'],
    'sales': [100, 150, 120, 180]
})

df

         date  sales
0  2023-01-01    100
1  2023-01-05    150
2  2023-02-01    120
3  2023-02-10    180

## to_datetime and DatetimeIndex

In [2]:
df['date'] = pd.to_datetime(df['date'])
df

        date  sales
0 2023-01-01    100
1 2023-01-05    150
2 2023-02-01    120
3 2023-02-10    180

In [3]:
df.set_index('date')

            sales
date
2023-01-01    100
2023-01-05    150
2023-02-01    120
2023-02-10    180

## Date components

In [4]:
df['year'] = df['date'].dt.year
df['month'] = df['date'].dt.month
df['day'] = df['date'].dt.day
df

        date  sales  year  month  day
0 2023-01-01    100  2023      1    1
1 2023-01-05    150  2023      1    5
2 2023-02-01    120  2023      2    1
3 2023-02-10    180  2023      2   10

In [5]:
df['weekday'] = df['date'].dt.day_name()
df

        date  sales  year  month  day    weekday
0 2023-01-01    100  2023      1    1     Sunday
1 2023-01-05    150  2023      1    5   Thursday
2 2023-02-01    120  2023      2    1  Wednesday
3 2023-02-10    180  2023      2   10     Friday

## Time zones

In [6]:
ts = pd.date_range('2023-01-01', periods=3, freq='D')
ts

DatetimeIndex(['2023-01-01', '2023-01-02', '2023-01-03'], dtype='datetime64[ns]', freq='D')

In [7]:
ts.tz_localize('UTC')

DatetimeIndex(['2023-01-01 00:00:00+00:00', '2023-01-02 00:00:00+00:00',
               '2023-01-03 00:00:00+00:00'],
              dtype='datetime64[ns, UTC]', freq='D')

In [8]:
ts.tz_localize('UTC').tz_convert('Asia/Kolkata')

DatetimeIndex(['2023-01-01 05:30:00+05:30', '2023-01-02 05:30:00+05:30',
               '2023-01-03 05:30:00+05:30'],
              dtype='datetime64[ns, Asia/Kolkata]', freq='D')

## Time series indexing

In [9]:
df_ts = df.set_index('date')
df_ts

            sales  year  month  day    weekday
date
2023-01-01    100  2023      1    1     Sunday
2023-01-05    150  2023      1    5   Thursday
2023-02-01    120  2023      2    1  Wednesday
2023-02-10    180  2023      2   10     Friday

In [11]:
df_ts.loc['2023-01']

            sales  year  month  day   weekday
date
2023-01-01    100  2023      1    1    Sunday
2023-01-05    150  2023      1    5  Thursday

In [12]:
df_ts.loc['2023-01-01':'2023-01-31']

            sales  year  month  day   weekday
date
2023-01-01    100  2023      1    1    Sunday
2023-01-05    150  2023      1    5  Thursday

## Resampling

In [ ]:
df_ts.resample('M').sum()

In [15]:
df_ts[['sales']].resample('W').mean()

            sales
date
2023-01-01  100.0
2023-01-08  150.0
2023-01-15    NaN
2023-01-22    NaN
2023-01-29    NaN
2023-02-05  120.0
2023-02-12  180.0

## Rolling time windows

In [17]:
df_ts[['sales', 'year', 'month', 'day']].rolling(window=2).mean()

            sales    year  month  day
date
2023-01-01    NaN     NaN    NaN  NaN
2023-01-05  125.0  2023.0    1.0  3.0
2023-02-01  135.0  2023.0    1.5  3.0
2023-02-10  150.0  2023.0    2.0  5.5

In [18]:
df_ts['sales'].rolling(window='10D').sum()

date
2023-01-01    100.0
2023-01-05    250.0
2023-02-01    120.0
2023-02-10    300.0
Name: sales, dtype: float64